Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM2532LS60064.atdf
      <value-group name="DMAC_QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="0x1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4"/>
        <value name="RESUME" caption="Channel resume operation" value="0x5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__LVL">
        <value name="LVL0" caption="Channel Priority Level 0" value="0x0"/>
        <value name="LVL1" caption="Channel Priority Level 1" value="0x1"/>
        <value name="LVL2" caption="Channel Priority Level 2" value="0x2"/>
        <value name="LVL3" caption="Channel Priority Level 3" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0"/>
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00"/>
        <value name="RTC_TIMESTAMP" caption="RTC Timestamp Trigger" value="0x01"/>
        <value name="DSU_DCC0" caption="ID for DCC0 register" value="0x02"/>
        <value name="DSU_DCC1" caption="ID for DCC1 register" value="0x03"/>
        <value name="SERCOM0_RX" caption="SERCOM0 RX Trigger" value="0x04"/>
        <value name="SERCOM0_TX" caption="SERCOM0 TX Trigger" value="0x05"/>
        <value name="SERCOM1_RX" caption="SERCOM1 RX Trigger" value="0x06"/>
        <value name="SERCOM1_TX" caption="SERCOM1 TX Trigger" value="0x07"/>
        <value name="SERCOM2_RX" caption="SERCOM2 RX Trigger" value="0x08"/>
        <value name="SERCOM2_TX" caption="SERCOM2 TX Trigger" value="0x09"/>
        <value name="SERCOM3_RX" caption="SERCOM3 RX Trigger" value="0x0A"/>
        <value name="SERCOM3_TX" caption="SERCOM3 TX Trigger" value="0x0B"/>
        <value name="SERCOM4_RX" caption="SERCOM4 RX Trigger" value="0x0C"/>
        <value name="SERCOM4_TX" caption="SERCOM4 TX Trigger" value="0x0D"/>
        <value name="SERCOM5_RX" caption="SERCOM5 RX Trigger" value="0x0E"/>
        <value name="SERCOM5_TX" caption="SERCOM5 TX Trigger" value="0x0F"/>
        <value name="TC0_OVF" caption="TC0 Overflow Trigger" value="0x10"/>
        <value name="TC0_MC0" caption="TC0 Match/Compare 0 Trigger" value="0x11"/>
        <value name="TC0_MC1" caption="TC0 Match/Compare 1 Trigger" value="0x12"/>
        <value name="TC1_OVF" caption="TC1 Overflow Trigger" value="0x13"/>
        <value name="TC1_MC0" caption="TC1 Match/Compare 0 Trigger" value="0x14"/>
        <value name="TC1_MC1" caption="TC1 Match/Compare 1 Trigger" value="0x15"/>
        <value name="TC2_OVF" caption="TC2 Overflow Trigger" value="0x16"/>
        <value name="TC2_MC0" caption="TC2 Match/Compare 0 Trigger" value="0x17"/>
        <value name="TC2_MC1" caption="TC2 Match/Compare 1 Trigger" value="0x18"/>
        <value name="TCC0_OVF" caption="TCC0 Overflow Trigger" value="0x19"/>
        <value name="TCC0_MC0" caption="TCC0 Match/Compare 0 Trigger" value="0x1A"/>
        <value name="TCC0_MC1" caption="TCC0 Match/Compare 1 Trigger" value="0x1B"/>
        <value name="TCC0_MC2" caption="TCC0 Match/Compare 2 Trigger" value="0x1C"/>
        <value name="TCC0_MC3" caption="TCC0 Match/Compare 3 Trigger" value="0x1D"/>
        <value name="TCC1_OVF" caption="TCC1 Overflow Trigger" value="0x1E"/>
        <value name="TCC1_MC0" caption="TCC1 Match/Compare 0 Trigger" value="0x1F"/>
        <value name="TCC1_MC1" caption="TCC1 Match/Compare 1 Trigger" value="0x20"/>
        <value name="TCC2_OVF" caption="TCC2 Overflow Trigger" value="0x21"/>
        <value name="TCC2_MC0" caption="TCC2 Match/Compare 0 Trigger" value="0x22"/>
        <value name="TCC2_MC1" caption="TCC2 Match/Compare 1 Trigger" value="0x23"/>
        <value name="TCC3_OVF" caption="TCC3 Overflow Trigger" value="0x24"/>
        <value name="TCC3_MC0" caption="TCC3 Match/Compare 0 Trigger" value="0x25"/>
        <value name="TCC3_MC1" caption="TCC3 Match/Compare 1 Trigger" value="0x26"/>
        <value name="TCC3_MC2" caption="TCC3 Match/Compare 2 Trigger" value="0x27"/>
        <value name="TCC3_MC3" caption="TCC3 Match/Compare 3 Trigger" value="0x28"/>
        <value name="ADC_RESRDY" caption="ADC Result Ready Trigger" value="0x29"/>
        <value name="DAC_EMPTY0" caption="DAC Empty 0 Trigger" value="0x2A"/>
        <value name="DAC_EMPTY1" caption="DAC Empty 1 Trigger" value="0x2B"/>
        <value name="PTC_EOC" caption="PTC End of Conversion Trigger" value="0x2C"/>
        <value name="PTC_SEQ" caption="PTC Sequence Trigger" value="0x2D"/>
        <value name="PTC_WCOMP" caption="PTC Window Compare Trigger" value="0x2E"/>
        <value name="I2S_RX0" caption="I2S RX0 Trigger" value="0x2F"/>
        <value name="I2S_RX1" caption="I2S RX1 Trigger" value="0x30"/>
        <value name="I2S_TX0" caption="I2S TX0 Trigger" value="0x31"/>
        <value name="I2S_TX1" caption="I2S TX1 Trigger" value="0x32"/>
      </value-group>
    </module>
    <module name="DSU" id="U2810" version="1.1.0" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory built-in self-test" mask="0x8"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
          <bitfield name="BREXT" caption="BootRom Phase Extension" mask="0x20"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" caption="Status B">
          <bitfield name="DAL" caption="Debugger Access Level" mask="0x3" values="DSU_STATUSB__DAL"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x4"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x8"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x10"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x20"/>
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x40"/>
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x80"/>
        </register>
