Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM2532LS60064.atdf
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="35" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0x7" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Division by GENCTRLn.DIV" value="0x0"/>
        <value name="DIV2" caption="Division by 2^(GENCTRLn.DIV+1)" value="0x1"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad (GCLK_IO)" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="4"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="5"/>
        <value name="DFLLULP" caption="DFLLULP output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="FDPLL96M" caption="FDPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
      </value-group>
    </module>
    <module name="I2S" id="U2224" version="2.1.0" caption="Inter-IC Sound Interface">
      <register-group name="I2S" caption="Inter-IC Sound Interface">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKEN0" caption="Clock Unit 0 Enable" mask="0x4"/>
          <bitfield name="CKEN1" caption="Clock Unit 1 Enable" mask="0x8"/>
          <bitfield name="TXEN" caption="Tx Serializer Enable" mask="0x10"/>
          <bitfield name="RXEN" caption="Rx Serializer Enable" mask="0x20"/>
        </register>
        <register name="CLKCTRL" offset="0x4" rw="RW" size="4" count="2" initval="0x00000000" caption="Clock Unit n Control">
          <bitfield name="SLOTSIZE" caption="Slot Size" mask="0x3" values="I2S_CLKCTRL__SLOTSIZE"/>
          <bitfield name="NBSLOTS" caption="Number of Slots in Frame" mask="0x1C"/>
          <bitfield name="FSWIDTH" caption="Frame Sync Width" mask="0x60" values="I2S_CLKCTRL__FSWIDTH"/>
          <bitfield name="BITDELAY" caption="Data Delay from Frame Sync" mask="0x80" values="I2S_CLKCTRL__BITDELAY"/>
          <bitfield name="FSSEL" caption="Frame Sync Select" mask="0x100" values="I2S_CLKCTRL__FSSEL"/>
          <bitfield name="FSINV" caption="Frame Sync Invert" mask="0x200"/>
          <bitfield name="FSOUTINV" caption="Frame Sync Output Invert" mask="0x400"/>
          <bitfield name="SCKSEL" caption="Serial Clock Select" mask="0x800" values="I2S_CLKCTRL__SCKSEL"/>
          <bitfield name="SCKOUTINV" caption="Serial Clock Output Invert" mask="0x1000"/>
          <bitfield name="MCKSEL" caption="Master Clock Select" mask="0x2000" values="I2S_CLKCTRL__MCKSEL"/>
          <bitfield name="MCKEN" caption="Master Clock Enable" mask="0x4000"/>
          <bitfield name="MCKOUTINV" caption="Master Clock Output Invert" mask="0x8000"/>
          <bitfield name="MCKDIV" caption="Master Clock Division Factor" mask="0x3F0000"/>
          <bitfield name="MCKOUTDIV" caption="Master Clock Output Division Factor" mask="0x3F000000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="Interrupt Enable Clear">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="Interrupt Enable Set">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
