Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM2532LS60064.atdf
        <register name="BOCOR_WORD_62" offset="0xF8" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 62">
          <bitfield name="BOOTROM_BOCORHASH_6" caption="Boot Configuration Row Hash bits 223:192" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_63" offset="0xFC" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 63">
          <bitfield name="BOOTROM_BOCORHASH_7" caption="Boot Configuration Row Hash bits 255:224" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" rw="R" size="4" caption="OTP1 Page Word 0">
          <bitfield name="BOOTROM_SECEN" caption="Security Enable Fuse" mask="0x400"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" rw="R" size="4" caption="OTP1 Page Word 1">
          <bitfield name="BOOTROM_NVMCRC" caption="CRC for NVM DWORD" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="OTP2_FUSES">
        <register name="OTP2_WORD_1" offset="0x4" rw="R" size="4" caption="OTP2 Page Word 1">
          <bitfield name="PM_NVM3VSWDIS" caption="3V NVM switch disable" mask="0x8000"/>
        </register>
      </register-group>
      <register-group name="SW_CALIB_FUSES">
        <register name="SW_CALIB_WORD_0" offset="0x0" rw="R" size="4" caption="SW_CALIB Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="DFLLULP_DIV_PL0" caption="DFLLULP DIV at PL0" mask="0x1C0"/>
          <bitfield name="DFLLULP_DIV_PL2" caption="DFLLULP DIV at PL2" mask="0xE00"/>
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x1F000"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x3E0000"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x1C00000"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0x7E000000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xB08F4377" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_SULCK" caption="NVM Secure Region Locks" mask="0x7"/>
          <bitfield name="NVMCTRL_NSULCK" caption="NVM Non-Secure Region Locks" mask="0x38"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x1F80"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x2000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0xC000"/>
          <bitfield name="WDT_RUNSTDBY" caption="WDT Run During Standby" mask="0x2000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFF0BB" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
          <bitfield name="IDAU_RXN" caption="RAM is eXecute Never" mask="0x800"/>
          <bitfield name="NVMCTRL_DXN" caption="DATA FLASH is eXecute Never" mask="0x1000"/>
        </register>
        <register name="USER_WORD_2" offset="0x8" rw="RW" size="4" initval="0xF03007FF" caption="USER Page Word 2">
          <bitfield name="IDAU_AS" caption="Application Secure" mask="0x7FF"/>
          <bitfield name="IDAU_ANSC" caption="Application Non-Secure Callable" mask="0xFF800"/>
          <bitfield name="IDAU_DS" caption="Data Secure" mask="0x1FC00000"/>
        </register>
        <register name="USER_WORD_3" offset="0xC" rw="RW" size="4" initval="0xFFFFFFFF" caption="USER Page Word 3">
          <bitfield name="IDAU_RS" caption="RAM Secure" mask="0x1FF"/>
          <bitfield name="NVMCTRL_URWEN" caption="User Row Write Enable" mask="0x400"/>
        </register>
        <register name="USER_WORD_4" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 4">
          <bitfield name="NONSECA_PAC" caption="PAC Non-Secure" mask="0x1"/>
          <bitfield name="NONSECA_PM" caption="PM Non-Secure" mask="0x2"/>
          <bitfield name="NONSECA_MCLK" caption="MCLK Non-Secure" mask="0x4"/>
          <bitfield name="NONSECA_RSTC" caption="RSTC Non-Secure" mask="0x8"/>
          <bitfield name="NONSECA_OSCCTRL" caption="OSCCTRL Non-Secure" mask="0x10"/>
          <bitfield name="NONSECA_OSC32KCTRL" caption="OSC32KCTRL Non-Secure" mask="0x20"/>
          <bitfield name="NONSECA_SUPC" caption="SUPC Non-Secure" mask="0x40"/>
          <bitfield name="NONSECA_GCLK" caption="GCLK Non-Secure" mask="0x80"/>
          <bitfield name="NONSECA_WDT" caption="WDT Non-Secure" mask="0x100"/>
          <bitfield name="NONSECA_RTC" caption="RTC Non-Secure" mask="0x200"/>
          <bitfield name="NONSECA_EIC" caption="EIC Non-Secure" mask="0x400"/>
          <bitfield name="NONSECA_FREQM" caption="FREQM Non-Secure" mask="0x800"/>
          <bitfield name="NONSECA_PORT" caption="PORT Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECA_AC" caption="AC Non-Secure" mask="0x2000"/>
        </register>
        <register name="USER_WORD_5" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 5">
          <bitfield name="NONSECB_IDAU" caption="IDAU Non-Secure" mask="0x1"/>
          <bitfield name="NONSECB_DSU" caption="DSU Non-Secure" mask="0x2"/>
          <bitfield name="NONSECB_NVMCTRL" caption="NVMCTRL Non-Secure" mask="0x4"/>
          <bitfield name="NONSECB_DMAC" caption="DMAC Non-Secure" mask="0x8"/>
          <bitfield name="NONSECB_USB" caption="USB Non-Secure" mask="0x20"/>
        </register>
        <register name="USER_WORD_6" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 6">
          <bitfield name="NONSECC_EVSYS" caption="EVSYS Non-Secure" mask="0x1"/>
          <bitfield name="NONSECC_SERCOM0" caption="SERCOM0 Non-Secure" mask="0x2"/>
          <bitfield name="NONSECC_SERCOM1" caption="SERCOM1 Non-Secure" mask="0x4"/>
          <bitfield name="NONSECC_SERCOM2" caption="SERCOM2 Non-Secure" mask="0x8"/>
          <bitfield name="NONSECC_SERCOM3" caption="SERCOM3 Non-Secure" mask="0x10"/>
          <bitfield name="NONSECC_SERCOM4" caption="SERCOM4 Non-Secure" mask="0x20"/>
          <bitfield name="NONSECC_SERCOM5" caption="SERCOM5 Non-Secure" mask="0x40"/>
          <bitfield name="NONSECC_TC0" caption="TC0 Non-Secure" mask="0x80"/>
          <bitfield name="NONSECC_TC1" caption="TC1 Non-Secure" mask="0x100"/>
          <bitfield name="NONSECC_TC2" caption="TC2 Non-Secure" mask="0x200"/>
          <bitfield name="NONSECC_TCC0" caption="TCC0 Non-Secure" mask="0x400"/>
          <bitfield name="NONSECC_TCC1" caption="TCC1 Non-Secure" mask="0x800"/>
          <bitfield name="NONSECC_TCC2" caption="TCC2 Non-Secure" mask="0x1000"/>
          <bitfield name="NONSECC_TCC3" caption="TCC3 Non-Secure" mask="0x2000"/>
          <bitfield name="NONSECC_ADC" caption="ADC Non-Secure" mask="0x4000"/>
          <bitfield name="NONSECC_DAC" caption="DAC Non-Secure" mask="0x8000"/>
          <bitfield name="NONSECC_PTC" caption="PTC Non-Secure" mask="0x10000"/>
          <bitfield name="NONSECC_TRNG" caption="TRNG Non-Secure" mask="0x20000"/>
          <bitfield name="NONSECC_CCL" caption="CCL Non-Secure" mask="0x40000"/>
          <bitfield name="NONSECC_I2S" caption="I2S Non-Secure" mask="0x80000"/>
          <bitfield name="NONSECC_OPAMP" caption="OPAMP Non-Secure" mask="0x100000"/>
          <bitfield name="NONSECC_TRAM" caption="TRAM Non-Secure" mask="0x200000"/>
        </register>
        <register name="USER_WORD_7" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="USER Page Word 7">
          <bitfield name="BOOTROM_CDIROFFSET" caption="Location of CDI value when DICE is programmed" mask="0xFFFFFFFF"/>
        </register>
        <register name="USER_WORD_8" offset="0x20" rw="RW" size="4" initval="0xE87673B6" caption="USER Page Word 8">
          <bitfield name="BOOTROM_USERCRC" caption="CRC for USER[1,2,3] DWORDS" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="OPAMP" id="U2237" version="2.0.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
